''' ΓΙΑ ΤΗΝ ΕΡΓΑΣΙΑ ΑΥΤΗ ΕΡΓΑΣΤΗΚΑΝ ΟΙ ΦΟΙΤΗΤΕΣ
ΚΑΡΟΛΙΔΗΣ ΘΕΟΔΩΡΟΣ(ΑΕΡΜ 2572)
ΕΜΜΑΝΟΥΗΛ ΣΕΡΑΦΕΙΜ '''

# ----------------------------------------------------------------------------------------------------------------------------------------------------------------

# ΕΙΣΑΓΩΓΗ ΒΙΒΛΙΟΘΗΚΩΝ

import random as rn

# ----------------------------------------------------------------------------------------------------------------------------------------------------------------

# ΠΑΡΑΚΑΤΩ ΓΡΑΦΩ ΤΟΝ ΚΩΔΙΚΑ ΤΗΣ ΚΛΑΣΗΣ "SakClass"

class SakClass:      
    ''' Η κλάση SakClass υλοποιεί το σακουλάκι που περιλαμβάνει τα γράμαμτα του παιχνιδιού και τις μεθόδους που χρρειαζόμαστε σχετικά με το σακουλάκι '''

    '''constructor της κλάσης. φτιάχνει μια δομή λεξικού που έχει ως key τα γράμματα και ως value τους βαθμους που δίνει το κάθε γράμμα.
Επίσης αρχικοποιεί μια λίστα που περιλαμβάνει ανακατεμένα όλα τα γράμματα που βρίσκονται στο σακουλάκι.
'''
    def __init__(self):              
        self.lets = {'Α':[12,1],'Β':[1,8],'Γ':[2,4],'Δ':[2,4],'Ε':[8,1],
                     'Ζ':[1,10],'Η':[7,1],'Θ':[1,10],'Ι':[8,1],'Κ':[4,2],
                     'Λ':[3,3],'Μ':[3,3],'Ν':[6,1],'Ξ':[1,10],'Ο':[9,1],
                     'Π':[4,2],'Ρ':[5,2],'Σ':[7,1],'Τ':[8,1],'Υ':[4,2], 
                     'Φ':[1,8],'Χ':[1,8],'Ψ':[1,10],'Ω':[3,3]
                    }       
        self.letlist = [ ]               
        self.randomize_sak()
        
    '''η μέθοδος αυτη χρησιμοποιείται για να ανακατέβει τα γράμματα της λίστας που περιλαμβάνει τα γράμματα απο το σακουλάκι'''
    def randomize_sak(self):
        self.letlist = []
        for i in self.lets:
            for k in range(self.lets[i][0]):
                self.letlist.append(i)
        rn.shuffle(self.letlist)

    '''με αυτή τη μέθοδο τραβάμε απο το σακουλακι Ν γράμματα.Το Ν δίνεται ως παράμετρος στην μέθοδο'''
    def get_letters(self,N):
        getlets = rn.sample(self.letlist,N)
        for i in getlets:
            if self.lets[i][0] > 0 :
                self.lets[i][0] -= 1
        self.randomize_sak()
        return getlets
    
    '''αυτη η μέθοδος χρησιμοποιείται για να επιστραφούν γράμματα στο σακουλάκι'''    
    def put_back_letters(self,backlets):
        for i in backlets:
            self.lets[i][0] += 1
        self.randomize_sak()

# ----------------------------------------------------------------------------------------------------------------------------------------------------------------

# ΠΑΡΑΚΑΤΩ ΓΡΑΦΩ ΤΟΝ ΚΩΔΙΚΑ ΤΗΣ ΚΛΑΣΗΣ "Player"

class Player:
    '''Η κλάση Player υλοποιεί τους πίχτες του παιχνιδιού'''

    '''onstructor της κλάσης.αρχικοποιεί την λίστα με τα γράμματα που θα διαθέτει ο παίχτης και το αρχικό του σκορ.'''
    def __init__(self):
        self.grammata =[]
        self.score = 0
        
    '''με την μέθοδο αυτή αλλάζουμε τα γράμματα που διαθέτει ο παίχτης'''
    def set_letters(self,newlets):
        self.grammata = newlets

    '''με την μεθοδο αυτη αλλάζουμε το σκορ του παιχτη'''
    def set_score(self,newscore):
        self.score = newscore

    '''με την μεθοδο αυτη παιρνουμε τα γράμματα που έχει στην διαθεση του ο παιχτης'''
    def get_the_letters(self):
        return self.grammata

    '''με την μεθοδο αυτη παιρνουμε το σκορ του παιχτη'''
    def get_the_score(self):
        return self.score

# ----------------------------------------------------------------------------------------------------------------------------------------------------------------



